{
    "projectNav": "Projekte",
    "contactNav": "Kontakt",
    "landingPageHeading": "seit 2019 erstelle ich full-stack Webseiten mit einem besonderen Fokus auf kreativen und mobile-first frontend Designs. Lass uns entwas großartiges erschaffen!",

    "meStartHeading": "Wie alles begann",
    "meStartText": "Mit dem Programmieren habe ich 2018 durch einen spielerischen Einstieg in Java, mit dem Entwickeln eines Minecraft-Netzwerks zusammen mit Freunden, angefangen. Im Laufe der Jahre habe ich dadurch mein Wissen im Bereich Java kontinuierlich verbessert und dabei neue Technologien wie Maven, git und SQL gelernt. Mit dem Fortschreiten der Netzwerkentwicklung ergaben sich Anfragen für eine eigene Website und ein Forum. Da mir die reine Programmierung mit Java allmählich etwas monoton wurde, habe ich es als Herausforderung gesehen, mich mit diesem Thema zu beschäftigen und habe angefangen, mich in die Webentwicklung einzuarbeiten. Ich habe mich von Anfang an sowohl mit frontend-Sprachen wie HTML, CSS und JavaScript als auch mit backend-Sprachen wie PHP auseinandergesetzt, um zu lernen, wie man fullstack Webseiten erstellt. Da mir die Webentwicklung sehr gefallen hat, habe ich mich immer weiter darauf spezialisiert und mehr und mehr Projekte umgesetzt, um vor allem mein Wissen in der Praxis zu vertiefen.",
    "meNowHeading": "Heute",
    "meNowText": "Neben Praktika im IT-Bereich, einschließlich Praktika bei PwC, Thyssenkrupp Steel und dem in Neuseeland ansässigen Unternehmen WekaOnline, habe ich auch zu verschiedenen kleineren Projekten und Start-ups beigetragen. Meine jüngste Arbeit war bei dem deutschen Start-up Scripzy, wo ich als Frontend-Entwickler tätig war und auch weiterhin Unterstützung bei ausgewählten Projekten leiste. Im Laufe dieser Beschäftigungen habe ich mich besonders auf das Frontend mit kreativen, mobile-first Designs und Animationen spezialisiert, aber auch einige Erfahrungen mit neuen backend Technologien wie Node.js und WordPress gemacht.",
    "meMeHeading": "Das bin ich",
    "meMeText": "Ich bin ein freundlicher, hilfsbereiter und zuverlässiger Mensch mit vielen verschiedenen Interessen und Hobbys. Neben dem Herumsitzen vor dem PC bin ich sportlich sehr aktiv und seit Abschluss meines Abiturs reise ich sehr gerne. Zusätzlich zu meinen persönlichen Interessen zeichnet sich meine Arbeitsweise durch eine strukturierte, methodische und transparente Herangehensweise aus. Ich gehe Probleme systematisch und eigenständig an, um innovative Lösungen zu entwickeln. Ich arbeite aber auch gerne im Team zusammen, um gemeinsam Herausforderungen zu überwinden, sich miteinander zu verbessern und coole Projekte zu erstellen.",

    "projectsHeading": "Projekte",
    "lyro": "Dieses Projekt ist eine Full-Stack-Website für einen Minecraft-Server. Die Website bietet detaillierte Informationen über den Server, seine Spiele, Teammitglieder und Support-Services. Benutzer können Spielinformationen erkunden, mit dem Server-Team in Kontakt treten, auf Support-Ressourcen zugreifen und ihre Konten verwalten. Mit Funktionen wie Login, E-Mail-Verifizierung, Ticketsystem und Benutzerprofilen war es eine herausfordernde Aufgabe, meine Backend-Fähigkeiten zu verbessern und gleichzeitig eine lebendige Community-Erfahrung zu bieten.",
    "projektkurs": "Ein Schulprojekt in meinem Projektkurs, um unsere Gruppenergebnisse auf kreative Weise zu präsentieren. Wir haben mit einem lokalen Politiker zusammengearbeitet, der uns viel Input mit seiner Meinung und Expertise gegeben hat. Die Website verfügt über einige Funktionen wie ein Login-System, um Dinge privat zu halten. Außerdem habe ich JavaScript-APIs wie Chart.js verwendet, um einige schicke animierte Diagramme zu erstellen, die unsere Daten wirklich zum Leben erwecken. Einerseits hat dieses Projekt meine JavaScript-Fähigkeiten verbessert, indem ich mit solchen APIs gearbeitet habe, und andererseits meine Fähigkeiten mit CSS und Responsivität.",
    "scripzy": "In meiner Rolle als Frontend-Entwickler für ein deutsches Startup war eines meiner neuesten Projekte die Wartelisten-Website. Diese Seite dient als Schlüsselelement der Pre-Launch-Strategie und ermutigt Benutzer dazu, sich für Updates zu den bevorstehenden Produkten und Dienstleistungen anzumelden. Als Frontend-Entwickler habe ich die gesamte Frontend-Architektur von Grund auf neu erstellt und mich dabei auf benutzerfreundliches Design und fesselnde Animationen mit HTML, CSS und JavaScript konzentriert. Dieses Projekt hat nicht nur meine Frontend-Fähigkeiten verbessert, insbesondere in Animationen und custom CSS-Bildern, sondern auch zum Wachstum des Startups beigetragen, indem es Benutzer angezogen und gehalten hat.",
    "viewProject": "Zum Projekt",

    "contactHeading": "Worauf wartest du!",
    "messageLabel": "Nachricht",
    "agreeTerms": "Hiermit stimme ich den <a href='law.html'>Datenschutzrichtlinien</a> zu",
    "submitText": "Senden"
}
