{
    "projectNav": "Work",
    "contactNav": "Contact",
    "landingPageHeading": "im building full-stack websites since 2019 focused on creative and responsive frontend designs. Let's build something amazing together!",

    "meStartHeading": "The beginning",
    "meStartText": "I started programming in 2018 with a playful introduction to Java, developing a Minecraft network together with friends. Over the years, this allowed me to continuously improve my knowledge in Java and learn new technologies such as Maven, git, and SQL. As the network development progressed, requests for a website and a forum emerged. Since pure Java programming gradually became somewhat monotonous for me, I saw it as a challenge to explore this topic and began to delve into web development. From the beginning, I engaged with both frontend languages like HTML, CSS, and JavaScript, as well as backend languages like PHP, to learn how to create full-stack websites. As I enjoyed web development a lot, I continued to specialize in it and implemented more and more projects to deepen my practical knowledge.",
    "meNowHeading": "Nowadays",
    "meNowText": "In addition to internships in the IT sector, including internships at PwC, Thyssenkrupp Steel, and the New Zealand-based company WekaOnline, I have also contributed to various smaller projects and startups. My most recent work was at the German startup Scripzy, where I worked as a frontend developer and still continue to provide support for selected projects. Throughout these engagements, I have particularly specialized in frontend development, focusing on creative, mobile-first designs and animations, but have also gained some experience with new backend technologies such as Node.js and WordPress.",
    "meMeHeading": "Thats me",
    "meMeText": "I am a friendly, helpful, and reliable person with a wide range of interests and hobbies. In addition to spending time in front of the computer, I am also very active in sports, and since completing my high school diploma, I have enjoyed traveling extensively. In addition to my personal interests, my approach to work is characterized by a structured, methodical, and transparent methodology. I tackle problems systematically and independently to develop innovative solutions. However, I also enjoy working collaboratively in teams to overcome challenges together, improve together, and create cool projects.",

    "projectsHeading": "Projects",
    "lyro": "This project is a full-stack Website for a Minecraft Server. This site offered detailed information about the server, its games, team members, and support services. Users could explore game details, connect with the server team, access support resources, and manage their accounts. With features like login, email verification, ticketing system, and user profiles, it was challenging project to enhance my backend skills while providing a vibrant community experience.",
    "projektkurs": "A school project, happening in my project class, that is all about creating a cool website to show off our group results in a creative way. We've collaborated with a local politician who gave us a lot of input with his opinion, experience and expertise.<br>The website has some neat features like a login system to keep things private. Moreover I used JavaScript APIs like Chart.js to make some fancy animated charts that really bring our data to life. On the one hand this project enhanced my js skills by working with such apis and on the other hand my skills with css and responsiveness.",
    "scripzy": "In my role as a frontend developer for a German startup, thats one of my latest project: the waitlist website. This site serves as a key component of the pre-launch strategy, encouraging users to sign up for updates on the upcoming products and services. As the frontend developer, I created the entire frontend architecture from scratch, focusing on user-friendly design and captivating animations using HTML, CSS, and JavaScript. This project not only improved my frontend skills, particularly in animation and custom CSS imagery, but also contributed to the startup's growth by attracting and retaining users.",
    "viewProject": "View Project",

    "contactHeading": "Let's get in touch!",
    "messageLabel": "Message",
    "agreeTerms": "I hereby agree to the <a href='law/law.html'>Privacy Policy</a>",
    "submitText": "Submit"
}
