{
    "projectNav": "Work",
    "contactNav": "Contact",
    "landingPageHeading": "im building full-stack websites since 2019 focused on creative and responsive frontend designs. Let's build something amazing together!",

    "meStartHeading": "Who I Am",
    "meStartText": "I’m Julius Krüger – a Computer Science student at Heidelberg University since 2024, with a particular interest in IT security, networking, and artificial intelligence. Since my first programming experience in 2018 with Java (e.g., creating a Minecraft server), I have continuously developed my skills – from frontend and backend technologies to web development and security-related topics.",
    "meNowHeading": "My Skills & Projects",
    "meNowText": "Throughout my previous work experiences – for example, internships at PwC, thyssenkrupp Steel Europe, and an e-commerce company from New Zealand – I have strengthened my skills in full-stack development, teamwork, and security, among others. In addition, I have gained practical experience in project management, for instance through the use of Scrum.",
    "meMeHeading": "My Goals & Vision",
    "meMeText": "I strive to build software solutions that are not only technically sound but also performant and secure. My goal is to work in the fields of IT security and machine learning/AI – both in research and in practical application. I want to be part of innovative projects that, for example, develop intelligent network analysis or automated security platforms.",


    "projectsHeading": "Projects",
    "lyro": "This project is a full-stack Website for a Minecraft Server. This site offered detailed information about the server, its games, team members, and support services. Users could explore game details, connect with the server team, access support resources, and manage their accounts. With features like login, email verification, ticketing system, and user profiles, it was challenging project to enhance my backend skills while providing a vibrant community experience.",
    "projektkurs": "A school project, happening in my project class, that is all about creating a cool website to show off our group results in a creative way. We've collaborated with a local politician who gave us a lot of input with his opinion, experience and expertise.<br>The website has some neat features like a login system to keep things private. Moreover I used JavaScript APIs like Chart.js to make some fancy animated charts that really bring our data to life. On the one hand this project enhanced my js skills by working with such apis and on the other hand my skills with css and responsiveness.",
    "scripzy": "In my role as a frontend developer for a German startup, thats one of my latest project: the waitlist website. This site serves as a key component of the pre-launch strategy, encouraging users to sign up for updates on the upcoming products and services. As the frontend developer, I created the entire frontend architecture from scratch, focusing on user-friendly design and captivating animations using HTML, CSS, and JavaScript. This project not only improved my frontend skills, particularly in animation and custom CSS imagery, but also contributed to the startup's growth by attracting and retaining users.",
    "viewProject": "View Project",


    "frontend": "Responsive web design using HTML5, CSS, and JavaScript",
    "backend": "Secure and high-performance web backends with Node.js or PHP, Wordpress",
    "sql": "Management, design, and optimization of relational databases",
    "java": "From fundamentals and asynchronous programming to developing custom REST APIs",
    "buildtools": "Automation of build processes using Maven and CMake",
    "c": "Implementation of small projects as part of university coursework",
    "git": "Use of Git and GitHub, including knowledge of automation with CI/CD",
    "linux": "Fundamentals of network, server, and web security, as well as social engineering",
    "vibeCoding": "Working more efficiently and effectively through smart and ethical use of AI assistants",



    "contactHeading": "Let's get in touch!",
    "messageLabel": "Message",
    "agreeTerms": "I hereby agree to the <a href='law.html'>Privacy Policy</a>",
    "submitText": "Submit"
}
